zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_M7_COMMON.h
  CM7_FLEXCAN2_INT9_15_IRQn    = 111,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  CM7_FLEXCAN3_INT0_8_IRQn     = 112,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  CM7_FLEXCAN3_INT9_15_IRQn    = 113,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  CM7_FLEXCAN4_INT0_8_IRQn     = 114,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  CM7_FLEXCAN4_INT9_15_IRQn    = 115,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  CM7_FLEXCAN5_INT0_8_IRQn     = 116,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  CM7_FLEXCAN5_INT9_15_IRQn    = 117,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  CM7_FLEXCAN6_INT0_8_IRQn     = 118,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  CM7_FLEXCAN6_INT9_15_IRQn    = 119,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  CM7_FLEXCAN7_INT0_8_IRQn     = 120,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  CM7_FLEXCAN7_INT9_15_IRQn    = 121,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  CM7_FLEXCAN8_INT0_8_IRQn     = 122,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  CM7_FLEXCAN8_INT9_15_IRQn    = 123,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  CM7_FLEXCAN9_INT0_8_IRQn     = 124,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  CM7_FLEXCAN9_INT9_15_IRQn    = 125,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  CM7_FLEXCAN10_INT0_8_IRQn    = 126,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  CM7_FLEXCAN10_INT9_15_IRQn   = 127,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  CM7_FLEXCAN11_INT0_8_IRQn    = 128,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  CM7_FLEXCAN11_INT9_15_IRQn   = 129,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  CM7_FLEXCAN12_INT0_8_IRQn    = 130,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  CM7_FLEXCAN12_INT9_15_IRQn   = 131,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  CM7_FLEXCAN13_INT0_8_IRQn    = 132,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  CM7_FLEXCAN13_INT9_15_IRQn   = 133,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  CM7_FLEXCAN14_INT0_8_IRQn    = 134,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  CM7_FLEXCAN14_INT9_15_IRQn   = 135,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  CM7_FLEXCAN15_INT0_8_IRQn    = 136,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  CM7_FLEXCAN15_INT9_15_IRQn   = 137,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  CM7_FLEXCAN16_INT0_8_IRQn    = 138,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  CM7_FLEXCAN16_INT9_15_IRQn   = 139,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  CM7_FLEXIO0_INT_IRQn         = 140,              /**< FlexIO */
  CM7_FLEXIO1_INT_IRQn         = 141,              /**< FlexIO */
  CM7_FLEXRAY_INT0_11_IRQn     = 142,              /**< LRAM Non-Corrected Error/DRAM Non-Corrected Error/LRAM Corrected Error/DRAM Corrected Error/Receive FIFO channel A not empty/Receive FIFO channel B not empty/Wakeup/Combined protocol status and error/Combined CHI error/Combined transmit message buffer/Combined receive message buffer/Global */
  CM7_LPI2C0_INT0_1_IRQn       = 143,              /**< Master/Slave */
  CM7_LPI2C1_INT0_1_IRQn       = 144,              /**< Master/Slave */
  CM7_LPI2C2_INT0_1_IRQn       = 145,              /**< Master/Slave */
  CM7_LPI2C3_INT0_1_IRQn       = 146,              /**< Master/Slave */
  CM7_LPSPI0_INT_IRQn          = 147,              /**< Transmit and receive data and errors */
  CM7_LPSPI1_INT_IRQn          = 148,              /**< Transmit and receive data and errors */
  CM7_LPSPI2_INT_IRQn          = 149,              /**< Transmit and receive data and errors */
  CM7_LPSPI3_INT_IRQn          = 150,              /**< Transmit and receive data and errors */
  CM7_LPSPI4_INT_IRQn          = 151,              /**< Transmit and receive data and errors */
  CM7_LPSPI5_INT_IRQn          = 152,              /**< Transmit and receive data and errors */
  CM7_LPSPI6_INT_IRQn          = 153,              /**< Transmit and receive data and errors */
  CM7_LPSPI7_INT_IRQn          = 154,              /**< Transmit and receive data and errors */
  CM7_LPUART0_INT0_1_IRQn      = 155,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART1_INT0_1_IRQn      = 156,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART2_INT0_1_IRQn      = 157,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART3_INT0_1_IRQn      = 158,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART4_INT0_1_IRQn      = 159,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART5_INT0_1_IRQn      = 160,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART6_INT0_1_IRQn      = 161,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART7_INT0_1_IRQn      = 162,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART8_INT0_1_IRQn      = 163,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART9_INT0_1_IRQn      = 164,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART10_INT0_1_IRQn     = 165,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART11_INT0_1_IRQn     = 166,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART12_INT0_1_IRQn     = 167,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART13_INT0_1_IRQn     = 168,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART14_INT0_1_IRQn     = 169,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART15_INT0_1_IRQn     = 170,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART16_INT0_1_IRQn     = 171,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART17_INT0_1_IRQn     = 172,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART18_INT0_1_IRQn     = 173,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART19_INT0_1_IRQn     = 174,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART20_INT0_1_IRQn     = 175,              /**< Transmit data and errors/Receive data and errors */
  CM7_LPUART_MSC_INT0_1_IRQn   = 176,              /**< Transmit data and errors/Receive data and errors */
  CM7_LFAST_INT0_4_IRQn        = 177,              /**< Transmit/Transmit exception/Receive/Receive exception/ICLC Receive */
  CM7_MSGINTR0_INT0_2_IRQn     = 178,              /**< Message signaled interrupt register 0/Message signaled interrupt register 1/Message signaled interrupt register 2 */
  CM7_MSGINTR1_INT0_2_IRQn     = 179,              /**< Message signaled interrupt register 0/Message signaled interrupt register 1/Message signaled interrupt register 2 */
  CM7_MSGINTR2_INT0_2_IRQn     = 180,              /**< Message signaled interrupt register 0/Message signaled interrupt register 1/Message signaled interrupt register 2 */
  CM7_MSGINTR3_INT0_2_IRQn     = 181,              /**< Message signaled interrupt register 0/Message signaled interrupt register 1/Message signaled interrupt register 2 */
  CM7_MSGINTR4_INT0_2_IRQn     = 182,              /**< Message signaled interrupt register 0/Message signaled interrupt register 1/Message signaled interrupt register 2 */
  CM7_MSGINTR5_INT0_2_IRQn     = 183,              /**< Message signaled interrupt register 0/Message signaled interrupt register 1/Message signaled interrupt register 2 */
  CM7_MSGINTR6_INT0_2_IRQn     = 184,              /**< Message signaled interrupt register 0/Message signaled interrupt register 1/Message signaled interrupt register 2 */
  CM7_MSGINTR7_INT0_2_IRQn     = 185,              /**< Message signaled interrupt register 0/Message signaled interrupt register 1/Message signaled interrupt register 2 */
  CM7_NETC_IEPRC_INT0_1_IRQn   = 186,              /**< NETC Root Complex PCI 0/NETC Root Complex PCI 1 */
  CM7_PSI50_INT0_23_IRQn       = 187,              /**< PSI5 channel 0 DMA combined; asserted when data overflow/underflow occurs or dma transfer finished/PSI5 channel 0 combined general; asserted when SENT message arrives/has an error or when the data output register request for new data or are overwritten when not ready to accept new data/PSI5 channel 0 new message received/PSI5 channel 0 message overwrite/PSI5 channel 0 error/PSI5 channel 0 combined/PSI5 channel 1 DMA combined; asserted when data overflow/underflow occurs or dma transfer finished/PSI5 channel 1 combined general; asserted when SENT message arrives/has an error or when the data output register request for new data or are overwritten when not ready to accept new data/PSI5 channel 1 new message received/PSI5 channel 1 message overwrite/PSI5 channel 1 error/PSI5 channel 1 combined/PSI5 channel 2 DMA combined; asserted when data overflow/underflow occurs or dma transfer finished/PSI5 channel 2 combined general; asserted when SENT message arrives/has an error or when the data output register request for new data or are overwritten when not ready to accept new data/PSI5 channel 2 new message received/PSI5 channel 2 message overwrite/PSI5 channel 2 error/PSI5 channel 2 combined/PSI5 channel 3 DMA combined; asserted when data overflow/underflow occurs or dma transfer finished/PSI5 channel 3 combined general; asserted when SENT message arrives/has an error or when the data output register request for new data or are overwritten when not ready to accept new data/PSI5 channel 3 new message received/PSI5 channel 3 message overwrite/PSI5 channel 3 error/PSI5 channel 3 combined */
  CM7_PSI51_INT0_23_IRQn       = 188,              /**< PSI5 channel 0 DMA combined; asserted when data overflow/underflow occurs or dma transfer finished/PSI5 channel 0 combined general; asserted when SENT message arrives/has an error or when the data output register request for new data or are overwritten when not ready to accept new data/PSI5 channel 0 new message received/PSI5 channel 0 message overwrite/PSI5 channel 0 error/PSI5 channel 0 combined/PSI5 channel 1 DMA combined; asserted when data overflow/underflow occurs or dma transfer finished/PSI5 channel 1 combined general; asserted when SENT message arrives/has an error or when the data output register request for new data or are overwritten when not ready to accept new data/PSI5 channel 1 new message received/PSI5 channel 1 message overwrite/PSI5 channel 1 error/PSI5 channel 1 combined/PSI5 channel 2 DMA combined; asserted when data overflow/underflow occurs or dma transfer finished/PSI5 channel 2 combined general; asserted when SENT message arrives/has an error or when the data output register request for new data or are overwritten when not ready to accept new data/PSI5 channel 2 new message received/PSI5 channel 2 message overwrite/PSI5 channel 2 error/PSI5 channel 2 combined/PSI5 channel 3 DMA combined; asserted when data overflow/underflow occurs or dma transfer finished/PSI5 channel 3 combined general; asserted when SENT message arrives/has an error or when the data output register request for new data or are overwritten when not ready to accept new data/PSI5 channel 3 new message received/PSI5 channel 3 message overwrite/PSI5 channel 3 error/PSI5 channel 3 combined */
  CM7_PSI5_S0_INT0_18_IRQn     = 189,              /**< PS_SR_IRQ[0]/PS_SR_IRQ[1]/PS_SR_IRQ[2]/PS_SR_IRQ[3]/PS_SR_IRQ[4]/PS_SR_IRQ[5]/PS_SR_IRQ[6]/PS_SR_IRQ[7]/PSI5_E2SSR[1]/PSI5_E2SSR[2]/PSI5_E2SSR[3]/PSI5_E2SSR[4]/PSI5_E2SSR[5]/PSI5_E2SSR[6]/PSI5_E2SSR[7]/PS_GLSR/PSI5_S_0_UART_RX/PSI5_S_0_UART_TX/PSI5_S_0_UART_ERR */
  CM7_PSI5_S1_INT0_18_IRQn     = 190,              /**< PS_SR_IRQ[0]/PS_SR_IRQ[1]/PS_SR_IRQ[2]/PS_SR_IRQ[3]/PS_SR_IRQ[4]/PS_SR_IRQ[5]/PS_SR_IRQ[6]/PS_SR_IRQ[7]/PSI5_E2SSR[1]/PSI5_E2SSR[2]/PSI5_E2SSR[3]/PSI5_E2SSR[4]/PSI5_E2SSR[5]/PSI5_E2SSR[6]/PSI5_E2SSR[7]/PS_GLSR/PSI5_S_0_UART_RX/PSI5_S_0_UART_TX/PSI5_S_0_UART_ERR */
  CM7_RXLUT_INT_IRQn           = 191,              /**< RXLUT */
  CM7_SIPI_INT0_IRQn           = 192,              /**< Read channel 2 */
  CM7_SIPI_INT1_6_IRQn         = 193,              /**< Read channel 1/Read channel 3/Read channel 4/Error 1/Error 2/Trigger command */
  CM7_SAI0_INT0_1_IRQn         = 195,              /**< Receive/Transmit */
  CM7_SAI1_INT0_1_IRQn         = 196,              /**< Receive/Transmit */
  CM7_uSDHC_INT_IRQn           = 197,              /**< uSDHC */
  CM7_LPE_eDMA3_TCD0_1_INT_IRQn = 199,             /**< DMA transfer complete and error channel 0/DMA transfer complete and error channel 1 */
  CM7_LPE_eDMA3_TCD2_3_INT_IRQn = 200,             /**< DMA transfer complete and error channel 2/DMA transfer complete and error channel 3 */
  CM7_LPE_eDMA3_TCD4_5_INT_IRQn = 201,             /**< DMA transfer complete and error channel 4/DMA transfer complete and error channel 5 */
  CM7_LPE_eDMA3_TCD6_7_INT_IRQn = 202,             /**< DMA transfer complete and error channel 6/DMA transfer complete and error channel 7 */
  CM7_LPE_eDMA3_TCD8_9_INT_IRQn = 203,             /**< DMA transfer complete and error channel 8/DMA transfer complete and error channel 9 */
  CM7_LPE_eDMA3_TCD10_11_INT_IRQn = 204,           /**< DMA transfer complete and error channel 10/DMA transfer complete and error channel 11 */
  CM7_LPE_XRDC_INT_IRQn        = 205,              /**< Transfer error */
  CM7_LPE_PMC_INT0_3_IRQn      = 208,              /**< Low-voltage detect on VDD_LVDS < 1.7V (LVDLVDSF flag)/Low-voltage detect VDD_HV_B < 3.0V (LVDB33F flag) and VDD_HV_B < 1.7V (LVDB18F flag)/High-voltage detect > x.xV (HVDxF flags) */
  CM7_LPE_MC_RGM_INT_IRQn      = 209,              /**< RGM */
  CM7_LPE_SWT_INT_IRQn         = 210,              /**< Initial time-out */
  CM7_LPE_SIUL2_INT_IRQn       = 211,              /**< Vector 0 */
  CM7_LPE_WKPU_INT0_8_IRQn     = 212,              /**< Group 0/Group 1/Group 2/Group 3/Group 4/Group 5/Group 6/Group 7/Group 8 */
  CM7_0_LPE_WKPU_INT10_IRQn    = 213,              /**< Per core: Active low non-maskable request 1 */
  CM7_1_LPE_WKPU_INT11_IRQn    = 213,              /**< Per core: Active low non-maskable request 2 */
  CM7_2_LPE_WKPU_INT12_IRQn    = 213,              /**< Per core: Active low non-maskable request 3 */
